OF1/data/cavity.original/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

fields          ( p U );

setFormat       raw;

sets
(
   verticalmidline
	{
	type lineCell;
	axis xyz;
	start 	(5e-2 -0.01 5e-3);
	end	(5e-2 0.11 5e-3);
	}
);


// ************************************************************************* //
